/*##################################### RTC ###################################
Порядок инициализации:
1.
################################################################################*/


#include "rtc.h"

void RTC_Init()
{
  //Снимаем защиту от записи
  PWR->CR |= PWR_CR_DBP;

  //Включаем источник тактирования
  RCC->CSR |= RCC_CSR_LSION;
  while(!(RCC->CSR & RCC_CSR_LSIRDY));

  //if(RTC->ISR&RTC_ISR_INITS)return; //прверка инициализации календаря?

  //reset
  RCC->BDCR |= RCC_BDCR_BDRST;
  RCC->BDCR &= ~RCC_BDCR_BDRST;
  
  //Устанавливаем источник тактирования для RTC (LSI)
  RCC->BDCR &= ~RCC_BDCR_RTCSEL;
  RCC->BDCR |= RCC_BDCR_RTCSEL_1;
  RCC->BDCR |= RCC_BDCR_RTCEN;

  //Снимаем защиту от записи регистров RTC
  RTC->WPR = 0xCA;
  RTC->WPR = 0x53;

  //Входим в режим инициализации
  RTC->ISR |= RTC_ISR_INIT;
  while(!(RTC->ISR & RTC_ISR_INITF));

  //Устанавливаем предделитель
  RTC->PRER = 0xFF;
  RTC->PRER |= 0x7F << 16;

  //Устанавливаем формат счёта часов (12/24)
  RTC->CR &= ~RTC_CR_FMT;

  //Установка начальных значений календаря и часов
  uint32_t tmp = 0;
  tmp |= 0x04;              //Дата, единицы
  tmp |= 0x00 << 4;         //Дата, десятки
  tmp |= 0x08 << 8;         //Месяц, единицы
  tmp |= 0x00 << 12;        //Месяц, десятки
  tmp |= 0x05 << 13;        //День недели
  tmp |= 0x07 << 16;        //Год, единицы
  tmp |= 0x01 << 20;        //Год, десятки
  RTC->DR = tmp;

  tmp = 0;
  tmp |= 0x01 << 20;    //Часы, десятки
  tmp |= 0x02 << 16;    //Часы, единицы
  tmp |= 0x05 << 12;    //Минуты, десятки
  tmp |= 0x09 << 8;     //Минуты, единицы
  tmp |= 0x05 << 4;     //Секунды, десятки
  tmp |= 0x03;          //Сееунды, единицы
  RTC->TR = tmp;

  //Выходим из режима инициализации
  RTC->ISR &= ~RTC_ISR_INIT;

  //Устанадиваем защиту от записи
  RTC->WPR = 0x00;
}
